validation/diluteCoupledHyperbolicFoam/riser/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default                         faceLimited     leastSquares 1.0;
    grad(p)                         leastSquares;
}

divSchemes
{
    default                         none;

    div(alphaRhoPhi.air,U.air)              bounded Gauss limitedLinearV 1;
    div(phi.air,U.air)              bounded Gauss limitedLinearV 1;
    div(phiRhoPhi.air,e.air)              bounded Gauss limitedLinear 1;
    div(phiRhoPhi.air,K)                  bounded Gauss limitedLinear 1;
    div(devRhoReff.air)             Gauss linear;
    div((phi.air|interpolate(thermo:rho.air)),U.air) Gauss linear;
    div((((alpha.air*thermo:rho.air)*nuEff.air)*dev2(T(grad(U.air))))) Gauss linear;
}

laplacianSchemes
{
    default                         Gauss linear corrected;
}

interpolationSchemes
{
    default                         linear;
}

snGradSchemes
{
    default                         corrected;
}


// ************************************************************************* //
